app/Models/HardwareModelsModel.php

    public function getList()
    {
    	$array = array('status' => 1);
        return $this->where($array)->get()->getResult();
---
SELECT *
FROM `hardware_models`
WHERE `status` = 1

    public function search_by_id($id){

        return $this->where('id',$id)->first();
---
SELECT *
FROM `hardware_models`
WHERE `id` = '1'
 LIMIT 1