app/Models/TicketActivityModel.php

SELECT *
FROM `ticket_activity`
WHERE `ticket_id` = '30'
ORDER BY `status_changed_on` DESC
 LIMIT 1
---
    public function getLast($id)
    {
        return $this->where('ticket_id', $id)
                    ->orderBy('status_changed_on', 'desc')->first();

SELECT *
FROM `ticket_activity`
WHERE `ticket_id` = '30'
ORDER BY `last_modified` DESC
---
    public function getAllDesc($id)
    {
        return $this->where('ticket_id', $id)
                    ->orderBy('last_modified', 'desc')->get()->getResult();

SELECT *
FROM `ticket_activity`
JOIN `ticket_master` ON `ticket_master`.`id` = `ticket_activity`.`ticket_id`
WHERE `ticket_id` = '30'
ORDER BY `last_modified` DESC
---
    public function getJoinedDataDesc($id)
    {
        // Example of a join query
        $builder = $this->db->table('ticket_activity');
        $builder->select('*');
        $builder->join('ticket_master', 'ticket_master.id = ticket_activity.ticket_id');
        $builder->where('ticket_id', $id);
        $query = $builder->orderBy('last_modified', 'desc')->get();