app/Models/TicketModel.php

    public function getList()
    {
        $this->join('issue_base', 'ticket_master.issue_id = issue_base.id')
            ->join('user_master', 'ticket_master.assigned_to = user_master.id');
        return $this->select('ticket_master.*, issue_base.issue_description AS issue_description, user_master.user_name AS name')
            ->orderBy('id', 'desc')->get()->getResult();
---
SELECT `ticket_master`.*, `issue_base`.`issue_description` AS `issue_description`, `user_master`.`user_name` AS `name`
FROM `ticket_master`
JOIN `issue_base` ON `ticket_master`.`issue_id` = `issue_base`.`id`
JOIN `user_master` ON `ticket_master`.`assigned_to` = `user_master`.`id`
ORDER BY `id` DESC