app/Models/UnitModel.php

    public function search_by_id($id){

        return $this->where('id',$id)->first();
---
SELECT *
FROM `units`
WHERE `id` = '1'
 LIMIT 1